In [1]:
import numpy as np
import pandas as pd

In [2]:
a=np.random.random((10, 4))
a

array([[0.10071974, 0.56505481, 0.10056902, 0.20456926],
       [0.1084871 , 0.47482978, 0.47779295, 0.28115597],
       [0.52077924, 0.52299663, 0.00461114, 0.16879482],
       [0.8054413 , 0.80929078, 0.53206877, 0.58246592],
       [0.41777613, 0.47817927, 0.29393835, 0.11662525],
       [0.20550319, 0.13217242, 0.67339141, 0.16747701],
       [0.60764959, 0.22572588, 0.15951387, 0.80214169],
       [0.82547088, 0.29319402, 0.37444115, 0.42012019],
       [0.76506356, 0.77310452, 0.24879112, 0.27556075],
       [0.5434387 , 0.10120935, 0.00613657, 0.57717806]])

In [3]:
df=pd.DataFrame(a, columns=['uno', 'dos', 'tres', 'cuatro'])

df

        uno       dos      tres    cuatro
0  0.100720  0.565055  0.100569  0.204569
1  0.108487  0.474830  0.477793  0.281156
2  0.520779  0.522997  0.004611  0.168795
3  0.805441  0.809291  0.532069  0.582466
4  0.417776  0.478179  0.293938  0.116625
5  0.205503  0.132172  0.673391  0.167477
6  0.607650  0.225726  0.159514  0.802142
7  0.825471  0.293194  0.374441  0.420120
8  0.765064  0.773105  0.248791  0.275561
9  0.543439  0.101209  0.006137  0.577178

In [4]:
df['tres']

0    0.100569
1    0.477793
2    0.004611
3    0.532069
4    0.293938
5    0.673391
6    0.159514
7    0.374441
8    0.248791
9    0.006137
Name: tres, dtype: float64

In [5]:
df.tres

0    0.100569
1    0.477793
2    0.004611
3    0.532069
4    0.293938
5    0.673391
6    0.159514
7    0.374441
8    0.248791
9    0.006137
Name: tres, dtype: float64

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
type(df.tres)

pandas.core.series.Series

In [8]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 'Pension Roma'], 
                      'stars':[5,4,2], 'Precio':[800, 500, 100]})

hoteles

         nombre  stars  Precio
0        Palace      5     800
1          Ritz      4     500
2  Pension Roma      2     100

In [9]:
hoteles.dtypes

nombre    object
stars      int64
Precio     int64
dtype: object

In [10]:
hoteles=pd.DataFrame({'nombre':['Palace', 'Ritz', 0], 
                      'stars':[5,4,2], 'Precio':[800, 500, 100]})

hoteles.dtypes

nombre    object
stars      int64
Precio     int64
dtype: object

In [11]:
hoteles

   nombre  stars  Precio
0  Palace      5     800
1    Ritz      4     500
2       0      2     100

In [12]:
hoteles.shape

(3, 3)

In [13]:
hoteles['ratio']=hoteles.stars/hoteles.Precio

hoteles

   nombre  stars  Precio    ratio
0  Palace      5     800  0.00625
1    Ritz      4     500  0.00800
2       0      2     100  0.02000

In [14]:
hoteles.T

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [15]:
hoteles.transpose()

              0      1     2
nombre   Palace   Ritz     0
stars         5      4     2
Precio      800    500   100
ratio   0.00625  0.008  0.02

In [16]:
hoteles.sum()

stars       11.00000
Precio    1400.00000
ratio        0.03425
dtype: float64

In [17]:
hoteles.max()

stars       5.00
Precio    800.00
ratio       0.02
dtype: float64

In [18]:
hoteles.mean()

stars       3.666667
Precio    466.666667
ratio       0.011417
dtype: float64

In [19]:
hoteles.median()

stars       4.000
Precio    500.000
ratio       0.008
dtype: float64

In [20]:
type(hoteles.median())

pandas.core.series.Series

In [21]:
hoteles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
nombre    3 non-null object
stars     3 non-null int64
Precio    3 non-null int64
ratio     3 non-null float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [22]:
hoteles.describe()

          stars      Precio     ratio
count  3.000000    3.000000  3.000000
mean   3.666667  466.666667  0.011417
std    1.527525  351.188458  0.007485
min    2.000000  100.000000  0.006250
25%    3.000000  300.000000  0.007125
50%    4.000000  500.000000  0.008000
75%    4.500000  650.000000  0.014000
max    5.000000  800.000000  0.020000

In [23]:
hoteles.describe().T

,count,mean,std,min,25%,50%,75%,max
stars,3.0,3.666667,1.527525,2.00000,3.000000,4.000,4.500,5.00
Precio,3.0,466.666667,351.188458,100.00000,300.000000,500.000,650.000,800.00
ratio,3.0,0.011417,0.007485,0.00625,0.007125,0.008,0.014,0.02

In [24]:
hoteles.describe().T['std']

stars       1.527525
Precio    351.188458
ratio       0.007485
Name: std, dtype: float64

In [25]:
pd.read_csv('data/alumnos.csv', sep=',')

  Nombre  Edad
0   Pepe    10
1   Juan    20
2   Luis    25
3   Fran  15xº

In [26]:
pd.read_json('data/alumnos.json')

  nombre  edad                                          aficiones
0   Pepe    10  [{'name': 'Beisbol', 'level': 2}, {'name': 'Fu...

In [27]:
pd.read_json('data/alumnos.json')['aficiones'][0]

[{'name': 'Beisbol', 'level': 2},
 {'name': 'Futbol', 'level': 1},
 {'name': 'Esgrima', 'level': 10}]

In [28]:
from pandas.io.json import json_normalize

In [29]:
df_json=pd.read_json('data/alumnos.json')

df_json

  nombre  edad                                          aficiones
0   Pepe    10  [{'name': 'Beisbol', 'level': 2}, {'name': 'Fu...

In [30]:
json_normalize(df_json.aficiones[0])

      name  level
0  Beisbol      2
1   Futbol      1
2  Esgrima     10

In [31]:
df2=pd.DataFrame()

for e in df_json.aficiones[0]:
    df2=df2.append(e, ignore_index=True)

In [32]:
df2

   level     name
0    2.0  Beisbol
1    1.0   Futbol
2   10.0  Esgrima

In [33]:
df2['col1']=[1,2,3]
df2

   level     name  col1
0    2.0  Beisbol     1
1    1.0   Futbol     2
2   10.0  Esgrima     3

In [34]:
df2['col1']=[5,6,7]

df2

   level     name  col1
0    2.0  Beisbol     5
1    1.0   Futbol     6
2   10.0  Esgrima     7

In [35]:
df2.to_json('data/alumnos_export2.json', orient='records')

In [36]:
!pip3 install openpyxl

Requirement already satisfied: openpyxl in /Users/data/Library/Python/3.7/lib/python/site-packages (3.0.0)
Requirement already satisfied: et-xmlfile in /Users/data/Library/Python/3.7/lib/python/site-packages (from openpyxl) (1.0.1)
Requirement already satisfied: jdcal in /Users/data/Library/Python/3.7/lib/python/site-packages (from openpyxl) (1.4.1)

In [37]:
df2.to_excel('data/alumnos_export2.xlsx')

In [38]:
import json

In [39]:
a={'nombre':'Pepe', 'apellidos':'Garcia'}

In [40]:
a

{'nombre': 'Pepe', 'apellidos': 'Garcia'}

In [41]:
b=json.dumps(a)

In [42]:
type(a)

dict

In [43]:
type(b)

str

In [44]:
b

'{"nombre": "Pepe", "apellidos": "Garcia"}'

In [45]:
a['nombre']

'Pepe'

In [46]:
b['nombre']

TypeError: string indices must be integers

In [47]:
b[0]

'{'

In [48]:
m=json.loads(b)
m

{'nombre': 'Pepe', 'apellidos': 'Garcia'}

In [49]:
type(m)

dict

In [50]:
import pickle

In [51]:
color={'leon':'amarillo', 'gato':'negro'}

with open('data/save.p', 'wb') as f:
    pickle.dump(color, f)
    
#pickle.dump(color, open('data/save.p', 'wb'))

color2=pickle.load(open('data/save.p', 'rb'))
color2

{'leon': 'amarillo', 'gato': 'negro'}

# Cleaning

In [52]:
import warnings
warnings.simplefilter('ignore')  # es para quitar prints de errores (deprecated)

In [53]:
df=pd.read_csv('data/vehicles/vehicles_messy.csv')  # cargar csv en dataframe

df.head()

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [54]:
df.shape   # dimensiones del df

(37843, 83)

In [55]:
df.columns   # columnas del df

Index(['barrels08', 'barrelsA08', 'charge120', 'charge240', 'city08',
       'city08U', 'cityA08', 'cityA08U', 'cityCD', 'cityE', 'cityUF', 'co2',
       'co2A', 'co2TailpipeAGpm', 'co2TailpipeGpm', 'comb08', 'comb08U',
       'combA08', 'combA08U', 'combE', 'combinedCD', 'combinedUF', 'cylinders',
       'displ', 'drive', 'engId', 'eng_dscr', 'feScore', 'fuelCost08',
       'fuelCostA08', 'fuelType', 'fuelType1', 'ghgScore', 'ghgScoreA',
       'highway08', 'highway08U', 'highwayA08', 'highwayA08U', 'highwayCD',
       'highwayE', 'highwayUF', 'hlv', 'hpv', 'id', 'lv2', 'lv4', 'make',
       'model', 'mpgData', 'phevBlended', 'pv2', 'pv4', 'range', 'rangeCity',
       'rangeCityA', 'rangeHwy', 'rangeHwyA', 'trany', 'UCity', 'UCityA',
       'UHighway', 'UHighwayA', 'VClass', 'year', 'youSaveSpend', 'guzzler',
       'trans_dscr', 'tCharger', 'sCharger', 'atvType', 'fuelType2', 'rangeA',
       'evMotor', 'mfrCode', 'c240Dscr', 'charge240b', 'c240bDscr',
       'createdOn', 'modifiedOn', 'startStop', 'phevCity', 'phevHwy',
       'phevComb'],
      dtype='object')

In [56]:
df.make.value_counts()   # cuenta los valores unicos de la columna

Chevrolet                    3795
Ford                         3102
Dodge                        2513
GMC                          2389
Toyota                       1919
                             ...
General Motors                  1
Grumman Allied Industries       1
Goldacre                        1
Shelby                          1
London Coach Co Inc             1
Name: make, Length: 133, dtype: int64

In [57]:
df.model.value_counts()

F150 Pickup 2WD                         207
Truck 2WD                               187
F150 Pickup 4WD                         185
Jetta                                   184
Mustang                                 184
                                       ...
Detomaso Mangusta                         1
Expedition Limo. 2WD FFV                  1
QX80 4WD (over 6000 lbs curb weight)      1
Landaulet                                 1
Continental GT Speed Convertible          1
Name: model, Length: 3692, dtype: int64

In [58]:
df.dtypes   # tipos de datos

barrels08     float64
barrelsA08    float64
charge120     float64
charge240     float64
city08          int64
               ...
modifiedOn     object
startStop      object
phevCity        int64
phevHwy         int64
phevComb        int64
Length: 83, dtype: object

In [59]:
df.info()   # informacion del df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37843 entries, 0 to 37842
Data columns (total 83 columns):
barrels08          37843 non-null float64
barrelsA08         37843 non-null float64
charge120          37843 non-null float64
charge240          37843 non-null float64
city08             37843 non-null int64
city08U            37843 non-null float64
cityA08            37843 non-null int64
cityA08U           37843 non-null float64
cityCD             37843 non-null float64
cityE              37843 non-null float64
cityUF             37843 non-null float64
co2                37843 non-null int64
co2A               37843 non-null int64
co2TailpipeAGpm    37843 non-null float64
co2TailpipeGpm     37843 non-null float64
comb08             37843 non-null int64
comb08U            37843 non-null float64
combA08            37843 non-null int64
combA08U           37843 non-null float64
combE              37843 non-null float64
combinedCD         37843 non-null float64
combinedUF         37843 non-null float64
cylinders          37720 non-null float64
displ              37723 non-null float64
drive              36654 non-null object
engId              37843 non-null int64
eng_dscr           22440 non-null object
feScore            37843 non-null int64
fuelCost08         37843 non-null int64
fuelCostA08        37843 non-null int64
fuelType           37843 non-null object
fuelType1          37843 non-null object
ghgScore           37843 non-null int64
ghgScoreA          37843 non-null int64
highway08          37843 non-null int64
highway08U         37843 non-null float64
highwayA08         37843 non-null int64
highwayA08U        37843 non-null float64
highwayCD          37843 non-null float64
highwayE           37843 non-null float64
highwayUF          37843 non-null float64
hlv                37843 non-null int64
hpv                37843 non-null int64
id                 37843 non-null int64
lv2                37843 non-null int64
lv4                37843 non-null int64
make               37843 non-null object
model              37843 non-null object
mpgData            37843 non-null object
phevBlended        37843 non-null bool
pv2                37843 non-null int64
pv4                37843 non-null int64
range              37843 non-null int64
rangeCity          37843 non-null float64
rangeCityA         37843 non-null float64
rangeHwy           37843 non-null float64
rangeHwyA          37843 non-null float64
trany              37832 non-null object
UCity              37843 non-null float64
UCityA             37843 non-null float64
UHighway           37843 non-null float64
UHighwayA          37843 non-null float64
VClass             37843 non-null object
year               37843 non-null int64
youSaveSpend       37843 non-null int64
guzzler            2281 non-null object
trans_dscr         15047 non-null object
tCharger           5186 non-null object
sCharger           666 non-null object
atvType            3072 non-null object
fuelType2          1408 non-null object
rangeA             1403 non-null object
evMotor            562 non-null object
mfrCode            7025 non-null object
c240Dscr           37 non-null object
charge240b         37843 non-null float64
c240bDscr          36 non-null object
createdOn          37843 non-null object
modifiedOn         37843 non-null object
startStop          6138 non-null object
phevCity           37843 non-null int64
phevHwy            37843 non-null int64
phevComb           37843 non-null int64
dtypes: bool(1), float64(32), int64(27), object(23)
memory usage: 23.7+ MB

In [60]:
nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

cylinders       123
displ           120
drive          1189
eng_dscr      15403
trany            11
guzzler       35562
trans_dscr    22796
tCharger      32657
sCharger      37177
atvType       34771
fuelType2     36435
rangeA        36440
evMotor       37281
mfrCode       30818
c240Dscr      37806
c240bDscr     37807
startStop     31705
dtype: int64

In [61]:
df=df.drop('guzzler', axis=1)  # borra una columna (axis=1)
df.guzzler

AttributeError: 'DataFrame' object has no attribute 'guzzler'

In [62]:
df=df.drop(columns=['trans_dscr', 'tCharger', 'sCharger',      
                    'atvType', 'fuelType2', 'rangeA' ,'evMotor',
                    'mfrCode', 'c240Dscr', 'c240bDscr', 'startStop'])

In [63]:
nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

cylinders      123
displ          120
drive         1189
eng_dscr     15403
trany           11
dtype: int64

In [64]:
df=df.drop('eng_dscr', axis=1)  # borra una columna (axis=1)


nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

cylinders     123
displ         120
drive        1189
trany          11
dtype: int64

In [65]:
bad_index=list(df.cylinders[df.cylinders.isna()].index) # lista de valores nulos (indice) de cilindros

bad_index[:10]  # lista de indices

[7138, 7139, 8143, 8144, 8146, 8147, 9212, 9213, 10329, 21413]

In [66]:
df.iloc[bad_index][['make', 'model', 'fuelType', 'cylinders']].head() 

# localiza por indice en el df, y selecciona 4 columnas y muestra los 5 primeros del df

        make                   model     fuelType  cylinders
7138  Nissan                Altra EV  Electricity        NaN
7139  Toyota                 RAV4 EV  Electricity        NaN
8143  Toyota                 RAV4 EV  Electricity        NaN
8144    Ford                   Th!nk  Electricity        NaN
8146    Ford  Explorer USPS Electric  Electricity        NaN

In [67]:
df[['displ', 'cylinders']]=df[['displ', 'cylinders']].fillna(0)

# en esas dos columnas rellena nulos con ceros

In [68]:
df.iloc[bad_index][['make', 'model', 'fuelType', 'cylinders']].head()

        make                   model     fuelType  cylinders
7138  Nissan                Altra EV  Electricity        0.0
7139  Toyota                 RAV4 EV  Electricity        0.0
8143  Toyota                 RAV4 EV  Electricity        0.0
8144    Ford                   Th!nk  Electricity        0.0
8146    Ford  Explorer USPS Electric  Electricity        0.0

In [69]:
nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

drive    1189
trany      11
dtype: int64

In [70]:
bad_index=list(df.drive[df.drive.isna()].index) # lista de valores nulos (indice) de drive

bad_index[:10]

[7138, 8144, 8147, 18217, 18218, 18219, 18220, 18221, 18222, 18223]

In [71]:
df.iloc[bad_index][['make', 'model', 'fuelType', 'drive']].head()

             make               model     fuelType drive
7138       Nissan            Altra EV  Electricity   NaN
8144         Ford               Th!nk  Electricity   NaN
8147       Nissan          Hyper-Mini  Electricity   NaN
18217  Alfa Romeo  Spider Veloce 2000      Regular   NaN
18218     Bertone                X1/9      Regular   NaN

In [72]:
df.drive

0                  Rear-Wheel Drive
1                  Rear-Wheel Drive
2                 Front-Wheel Drive
3                  Rear-Wheel Drive
4        4-Wheel or All-Wheel Drive
                    ...
37838             Front-Wheel Drive
37839             Front-Wheel Drive
37840    4-Wheel or All-Wheel Drive
37841    4-Wheel or All-Wheel Drive
37842    4-Wheel or All-Wheel Drive
Name: drive, Length: 37843, dtype: object

In [73]:
df['drive']=df['drive'].fillna('Unknown')

In [74]:
nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

trany    11
dtype: int64

In [75]:
df.trany

0           Manual 5-spd
1           Manual 5-spd
2           Manual 5-spd
3        Automatic 3-spd
4           Manual 5-spd
              ...
37838    Automatic 4-spd
37839       Manual 5-spd
37840    Automatic 4-spd
37841       Manual 5-spd
37842    Automatic 4-spd
Name: trany, Length: 37843, dtype: object

In [76]:
df['trany']=df['trany'].fillna('Unknown')  # se rellena con desconocido

In [77]:
nan_cols=df.isna().sum()  # columnas con nulos

nan_cols[nan_cols>0]

Series([], dtype: int64)